Вот несколько простых и интересных задач на вложенные циклы в Python, которые подойдут для школьников. Эти задачи помогут закрепить понимание концепции вложенных циклов и научат использовать их на практике. 🌟

### Задача 1: Таблица умножения

**Описание:** Напишите программу, которая выводит таблицу умножения от 1 до 10.

```python
for i in range(1, 11):
    for j in range(1, 11):
        print(f"{i * j:4}", end=' ')  # Выравнивание для красивого отображения
    print()  # Переход на новую строку после каждой строки таблицы
```

### Задача 2: Вывод матрицы

**Описание:** Создайте 3x3 матрицу и заполните её числами от 1 до 9. Выведите на экран.

```python
matrix = [[0, 0, 0] for _ in range(3)]  # Создаем пустую матрицу 3x3
count = 1
for i in range(3):
    for j in range(3):
        matrix[i][j] = count
        count += 1

# Вывод матрицы
for row in matrix:
    for element in row:
        print(element, end=' ')
    print()
```

### Задача 3: Звёздочки в треугольнике

**Описание:** Напишите программу, которая рисует треугольник из звёздочек. Число строк треугольника вводит пользователь.

```python
n = int(input("Введите количество строк треугольника: "))
for i in range(1, n + 1):
    for j in range(i):
        print('*', end=' ')
    print()  # Переход на новую строку после каждой строки треугольника
```

### Задача 4: Ввод матрицы и подсчет суммы элементов

**Описание:** Требуется создать программу, которая запрашивает у пользователя размеры матрицы (количество строк и столбцов), затем запрашивает сами элементы матрицы и подсчитывает их сумму.

```python
rows = int(input("Введите количество строк матрицы: "))
cols = int(input("Введите количество столбцов матрицы: "))

matrix = []
for i in range(rows):
    row = []
    for j in range(cols):
        element = int(input(f"Введите элемент [{i+1}][{j+1}]: "))
        row.append(element)
    matrix.append(row)

# Подсчет суммы элементов
total_sum = 0
for row in matrix:
    for element in row:
        total_sum += element

print(f"Сумма всех элементов матрицы: {total_sum}")
```

### Задача 5: Уникальные пары чисел

**Описание:** Напишите программу, которая генерирует все уникальные пары чисел из списка. Например, для списка `[1, 2, 3]` вывод должен быть: `(1, 2)`, `(1, 3)`, `(2, 3)`.

```python
numbers = [1, 2, 3]
for i in range(len(numbers)):
    for j in range(i + 1, len(numbers)):
        print(f"({numbers[i]}, {numbers[j]})")
```

### Задача 6: Флеш-карты

**Описание:** Создайте программу, которая создает набор флеш-карт с терминами и их определениями. Создайте 3 карточки (термин и определение) с использованием вложенных циклов.

```python
flashcards = [
    ("Python", "Язык программирования"),
    ("Список", "Структура данных, хранящая несколько элементов"),
    ("Цикл", "Конструктивный элемент для повторения операций")
]

for term, definition in flashcards:
    print(f"Термин: {term}")
    print(f"Определение: {definition}")
    print("------")
```

Эти задания помогут ученикам понять, как работают вложенные циклы, и научат их применять эти знания в различных сценариях. 🎉

